# Project 2 Part 3B

**Student:** Matthew Malueg

## Loading, Imports, Preparation

In [1]:
import pandas as pd
import tmdbsimple as tmdb
import pymysql, os, time, json
from urllib.parse import quote_plus
from sqlalchemy.types import *
from sqlalchemy.engine import create_engine
from sqlalchemy_utils import create_database, database_exists
pymysql.install_as_MySQLdb()

**Generate databases to work with**

In [2]:
# Load movie titles
title_basics = pd.read_csv('Data/movie_basics.csv')
# Load tmdb info
tmdb_info = pd.read_csv('DATA/tmdb_results_combined.csv.gz')

**Creating connection**

In [3]:
connection_str = "mysql+pymysql://root:root@localhost/movies"
engine = create_engine(connection_str)
conn = engine.connect()

**API credentials**

In [4]:
with open('/Users/Malue/.secret/tmdb_api.json', 'r') as f:
    login = json.load(f)
# Display the keys of the loaded dict
login.keys()

dict_keys(['api-key'])

In [5]:
tmdb.API_KEY = login['api-key']

## Normalizing and adding 'genres' and 'title_genres'

**Get a list of unique genres**

In [6]:
# Split the 'genres' column
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...,...
86974,10016149,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
86975,10016544,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
86976,10016684,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
86977,10016693,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
86978,10016777,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [7]:
# Use .explode() to separate the list of genres into new rows - one for each genre a movie belongs to
exploded_genres = title_basics.explode('genres_split')
exploded_genres.head(5)

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama

In [8]:
# Get the unique genres from the genres_split column, and format into a sorted list for later use
unique_genres = sorted(exploded_genres['genres_split'].unique())

**Create a new title_genres table**

In [9]:
# Save only the tconst and genres_split columns as a new dataframe
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

**Create a genre mapper dictionary to replace string genres with integers**

In [10]:
# Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
# This method create a dictionary by 'zipping' together two lists
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

**Repalce the string genres in title_genres with the new int ids**
- Create a new genre_id col using genre_map dictionary above, and either .map or .replace
- Drop the now unneeded genres_split column
- title_genres table should now be ready for adding to SQL database

In [11]:
# Make new integer genre_id and drop string genre names
title_genres['genre_id'] = title_genres['genres_split'].replace(genre_map)
title_genres = title_genres.drop(columns='genres_split')

**Add title_genres DataFrame to SQL database**

In [25]:
title_genres.to_sql('title_genres', conn, index=False, if_exists='append')

162600

**Create a genre_lookup dataframe for converting genre string names to ints**

In [12]:
genre_lookup = pd.DataFrame({'genre_name': genre_map.keys(),
                             'genre_id': genre_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

**Add genre_lookup DataFrame to SQL database**

In [28]:
genre_lookup.to_sql('genres', conn, index=False, if_exists='append')

25

## Creating the MySQL tables with a primary key with Python

- Each table must have an assigned Primary Key when created with Pandas + SQLAlchemy (if it is not a joiner table, which has to primary key).

**Integer-only Primary Keys**
- In an integer-only id column, assigning it as a primary key would be quite simple

In [13]:
## Set the DataFrame index and use index=True
# title_basics.set_index('genre_id').to_sql('genres', conn, index=True)

**Using tconst (or imdb_id) as the Primary Key**
- To use a string column as the primary key, provide the SQL datatype schema of the columns when creating the table.
    - Then, use the engine to run the command to alter the table and add tconst as the primary key.

#### 1. Creating a data type schema for to_sql

- Check the dtypes of your DataFrame (df.dtypes)
- Create a dictionary with each column name as a key and the corresponding SQL datatype as the value.
- **Note on string columns**:
    - For string columns with 'object' type, use:
        - The CHAR type if the column will become the primary key and has a fixed length
        - The VARCHAR datatype otherwise
        - Both CHAR/VARCHAR will need the maximum string length to use for that column
- The maximum string length can be found using max_str_len for any text column by using the following code:
    - `max_str_len = df['column'].fillna('').map(len).max()`
    - Then, use 1 larger than the max_str_len for your string/text object

In [14]:
title_basics.head()

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]

In [15]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = tmdb_info['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_info['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": CHAR(key_len+1), 
    "budget": FLOAT(),
    "revenue": FLOAT(),
    'certification':CHAR(cert_len+1)}

#### 2. Run df.to_sql with the dtype argument

- Use the dictionary as the dtype argument in df.to_sql (make sure index=False)

In [16]:
# Save to sql with dtype and index=False
tmdb_info.to_sql('tmdb_data', conn, dtype=df_schema, if_exists='replace', index=False)

2651

#### 3. Run the query to ADD PRIMARY KEY

- Finally, use the sqlalchemy engine to update the table and set the desired column as the primary key

In [18]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

## Examine new tables

### 1. Show all tables are present

In [19]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data

### 2. Show tmdb_data table

In [31]:
q = """DESCRIBE tmdb_data;"""
pd.read_sql(q, conn)

                    Field      Type Null  Key Default Extra
0                 imdb_id  char(11)   NO  PRI    None
1                   adult    double  YES         None
2           backdrop_path      text  YES         None
3   belongs_to_collection      text  YES         None
4                  budget     float  YES         None
5                  genres      text  YES         None
6                homepage      text  YES         None
7                      id    double  YES         None
8       original_language      text  YES         None
9          original_title      text  YES         None
10               overview      text  YES         None
11             popularity    double  YES         None
12            poster_path      text  YES         None
13   production_companies      text  YES         None
14   production_countries      text  YES         None
15           release_date      text  YES         None
16                revenue     float  YES         None
17                runtime    double  YES         None
18       spoken_languages      text  YES         None
19                 status      text  YES         None
20                tagline      text  YES         None
21                  title      text  YES         None
22                  video    double  YES         None
23           vote_average    double  YES         None
24             vote_count    double  YES         None
25          certification   char(6)  YES         None

In [32]:
q = """SELECT * FROM tmdb_data LIMIT 5;"""
pd.read_sql(q, conn)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0035423,0.0,/tJLV3BAlHOgscVOrA99Wnb2gAef.jpg,None,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",None,11232.0,en,Kate & Leopold,...,76019000.0,118.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.319,1238.0,PG-13
1,tt0096056,0.0,/95U3MUDXu4xSCmVLtWgargRipDi.jpg,None,0.0,"[{'id': 18, 'name': 'Drama'}]",None,109809.0,en,Crime and Punishment,...,0.0,126.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,None,Crime and Punishment,0.0,5.300,12.0,None
2,tt0114447,0.0,None,None,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",None,151007.0,en,The Silent Force,...,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,They left him for dead... They should have fin...,The Silent Force,0.0,5.000,3.0,None
3,tt0116916,0.0,/rFpHBidSlhjflmnLu7BZilyKeQR.jpg,None,0.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",None,73549.0,en,The Dark Mist,...,0.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,None,The Dark Mist,0.0,3.500,2.0,PG
4,tt0118589,0.0,/9NZAirJahVilTiDNCHLFcdkwkiy.jpg,None,22000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10402, 'n...",None,10696.0,en,Glitter,...,5271670.0,104.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"In music she found her dream, her love, herself.",Glitter,0.0,4.405,132.0,PG-13

### 3. Show updated 'title_genres' table

In [26]:
q = """DESCRIBE title_genres;"""
pd.read_sql(q, conn)

      Field         Type Null  Key Default Extra
0    tconst  varchar(10)   NO  PRI    None
1  genre_id          int   NO  PRI    None

In [27]:
q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q, conn)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

### 4. Show updated 'genres' table

In [29]:
q = """DESCRIBE genres;"""
pd.read_sql(q, conn)

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [30]:
q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q, conn)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography